// Напишите программу, которая на вход принимает два числа и выдает, какое число большее, а какое меньшее.
// Например:
// a = 5; b = 7-> max = 7
// a = 2; b = 10-> max = 10
// a = -9; b = -3-> max = -3


Console.Write("Введите значение: ");
int a = Convert.ToInt32(Console.Read());
int b = Convert.ToInt32(Console.Read());
if (a == b) 
if (a < b)
{   
   Console.Write($"Max = b");
   Console.Write($"Min = a");
}
// Не пойму или из-за оболочки терминала или действительно что-то не так, но ошибок не выдает. Прокаментируйте пожалуйста.